Revit 2027 API
StructuralElementDefinitionData.EndShortening Property
 Cutback or extension at element curve end.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndShortening { get; }
Public ReadOnly Property EndShortening As Double
	Get
public:
property double EndShortening {
	double get ();
}
member EndShortening : float with get
Property Value
Double
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace